[
  {
    "endYear": -19,
    "startYear": -85,
    "title": "Republic Era",
    "type": "era"
  },
  {
    "endYear": 5,
    "startYear": -19,
    "title": "Imperial Era",
    "type": "era"
  },
  {
    "endYear": 50,
    "startYear": 5,
    "title": "New Republic Era",
    "type": "era"
  },
  {
    "altTitle": "Darth Vadar",
    "endYear": 4,
    "imageUrl": "/images/vadar-kid.jpg",
    "imageYears": [
      {
        "endYear": 4,
        "imageUrl": "/images/vadar.png",
        "startYear": -19
      },
      {
        "endYear": -19,
        "imageUrl": "/images/anakin.png",
        "startYear": -28
      },
      {
        "endYear": -28,
        "imageUrl": "/images/vadar-kid.jpg",
        "startYear": -41
      }
    ],
    "seenIn": [
      "Episode I: The Phantom Menace",
      "Episode II: Attack of the Clones",
      "Episode III: Revenge of the Sith",
      "The Clone Wars (movie)",
      "The Clone Wars (TV series)",
      "Star Wars Rebels",
      "Rogue One: A Star Wars Story",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "Episode VI: Return of the Jedi"
    ],
    "startYear": -41,
    "title": "Anakin Skywalker",
    "type": "character",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Tatooine"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ],
    "description": "Anakin Skywalker was a legendary Force-sensitive human male who was a Jedi Knight of the Galactic Republic and the prophesied Chosen One of the Jedi Order, destined to bring balance to the Force. Also known as &quot;Ani&quot; during his childhood, Skywalker earned the moniker &quot;Hero With No Fear&quot; from his accomplishments in the Clone Wars. His alter ego, Darth Vader, the Dark Lord of the Sith, was created when Skywalker turned to the dark side of the Force, pledging his allegiance to the Sith Lord Darth Sidious at the end of the Republic Era.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Anakin_Skywalker"
  },
  {
    "endYear": 34,
    "imageUrl": "/images/skywalker-farmboy.jpg",
    "imageYears": [
      {
        "endYear": 3,
        "imageUrl": "/images/skywalker-farmboy.jpg",
        "startYear": -19
      },
      {
        "endYear": 25,
        "imageUrl": "/images/skywalker-jedi.jpg",
        "startYear": 3
      },
      {
        "endYear": 34,
        "imageUrl": "/images/skywalker.png",
        "startYear": 26
      }
    ],
    "seenIn": [
      "Episode III: Revenge of the Sith",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "Episode VI: Return of the Jedi",
      "The Mandalorian",
      "Episode VII: The Force Awakens",
      "Episode VIII: The Last Jedi",
      "Episode IX: The Rise of Skywalker"
    ],
    "startYear": -19,
    "title": "Luke Skywalker",
    "type": "character",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Tatooine"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ],
    "description": "Luke Skywalker, a Force-sensitive human male, was a legendary Jedi Master who fought in the Galactic Civil War during the reign of the Galactic Empire. Along with his companions, Princess Leia Organa and General Han Solo, Skywalker served as a revolutionary on the side of the Alliance to Restore the Republic—an organization committed to the downfall of the Galactic Empire and the restoration of democracy. Following the war, Skywalker became a living legend, and was remembered as one of the greatest Jedi in galactic history.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Luke_Skywalker"
  },
  {
    "altTitle": "The Child",
    "endYear": 50,
    "endYearUnknown": true,
    "imageUrl": "/images/grogu.png",
    "startYear": -41,
    "title": "Grogu",
    "type": "character",
    "description": "Grogu, known to many simply as &quot;the Child,&quot; was a male Force-sensitive Jedi and Mandalorian foundling who belonged to the same species as Jedi Grand Master Yoda and Jedi Master Yaddle. Grogu was born in the year 41 BBY, and was raised at the Jedi Temple on Coruscant.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Grogu",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Unknown"
      },
      {
        "name": "Species",
        "value": "Yoda's Species"
      }
    ],
    "seenIn": [
      "The Mandalorian"
    ]
  },
  {
    "endYear": 20,
    "seenIn": [
      "The Clone Wars (movie)",
      "The Clone Wars (TV series)",
      "The Mandalorian"
    ],
    "imageYears": [
      {
        "endYear": 20,
        "imageUrl": "/images/ahsoka.png",
        "startYear": 2
      }
    ],
    "startYear": -36,
    "title": "Ahsoka Tano",
    "imageUrl": "/images/ahsoka-young.png",
    "type": "character",
    "description": "Ahsoka Tano was a Force-sensitive Togruta female former Jedi Padawan who, after the Clone Wars, helped establish a network of various rebel cells against the Galactic Empire. Tano was discovered on her homeworld of Shili by Jedi Master Plo Koon, who brought her to the Jedi Temple on Coruscant to receive Jedi training. Following the outbreak of the Clone Wars, Jedi Grand Master Yoda assigned the young Tano to be the Padawan learner of Jedi Knight Anakin Skywalker, who nicknamed her &quot;Snips&quot; when she joined him at the Battle of Christophsis. Whereas Tano was eager to prove herself, Skywalker had a reputation for recklessness, and they had a rather difficult start as master and apprentice. Yet they worked together to rescue Rotta, the son of crime lord Jabba Desilijic Tiure, and returned Rotta to his father, thus facilitating a crucial alliance between the Hutt Clan and the Galactic Republic.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Ahsoka_Tano",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Shili"
      },
      {
        "name": "Species",
        "value": "Togruta"
      }
    ]
  },
  {
    "altTitle": "Darth Sidious",
    "endYear": 35,
    "imageUrl": "/images/palpatine-young.png",
    "imageYears": [
      {
        "endYear": 0,
        "imageUrl": "/images/palpatine.png",
        "startYear": -19
      },
      {
        "endYear": 25,
        "imageUrl": "/images/palpatine-og.png",
        "startYear": 0
      },
      {
        "endYear": 35,
        "imageUrl": "/images/palpatine-end.png",
        "startYear": 25
      }
    ],
    "seenIn": [
      "Episode I: The Phantom Menace",
      "Episode II: Attack of the Clones",
      "The Clone Wars (movie)",
      "The Clone Wars (TV series)",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "Episode VI: Return of the Jedi",
      "Episode IX: The Rise of Skywalker"
    ],
    "startYear": -84,
    "title": "Sheev Palpatine",
    "type": "character",
    "description": "Darth Sidious, born Sheev Palpatine and also known simply as the Emperor, was a human male Dark Lord of the Sith and Emperor of the Galactic Empire, ruling from 19 BBY to 4 ABY. Rising to power in the Republic Senate as the senator of Naboo, the secretive Sith Lord cultivated two identities, Sidious and Palpatine, using both to further his political career. He orchestrated the fall of the Galactic Republic and the Jedi Order through the Clone Wars, and then established his reign over the galaxy which lasted until his death at the Battle of Endor. However, the dark side of the Force gave rise to powers which allowed the Emperor to return from the grave.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Darth_Sidious",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Naboo"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "endYear": 50,
    "endYearUnknown": true,
    "imageUrl": "/images/rey.png",
    "seenIn": [
      "Episode VII: The Force Awakens",
      "Episode VIII: The Last Jedi",
      "Episode IX: The Rise of Skywalker"
    ],
    "startYear": 15,
    "title": "Rey Skywalker",
    "type": "character",
    "description": "Rey Skywalker, once known only as Rey, was a human female Jedi Master who fought on the side of the Resistance in the war against the First Order. A former scavenger from the planet Jakku, her life was changed by the tumultuous events of the last days of the New Republic Era. Her decision to help the droid BB-8 would set Rey on a course to discovering the Force that awakened within her, leading her to seek out Jedi Master Luke Skywalker for training. Yet despite her commitment to the Jedi Order and the light side of the Force, Rey felt the pull to the dark side due to her anger and the adversarial relationship she had with Ben Solo, a fallen Jedi whom she knew as the dark warrior Kylo Ren. The unique Force-bond between them was a result of their nature as a dyad in the Force.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Rey_Skywalker",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Jakku"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "endYear": 50,
    "endYearUnknown": true,
    "imageUrl": "/images/poe.png",
    "seenIn": [
      "Episode VII: The Force Awakens",
      "Episode VIII: The Last Jedi",
      "Episode IX: The Rise of Skywalker",
      "Star Wars Resistance"
    ],
    "startYear": 2,
    "title": "Poe Dameron",
    "type": "character",
    "description": "Poe Dameron was a human male who originally served as a member of the Spice Runners of Kijimi, before becoming a pilot in the New Republic and eventually joining the Resistance, rising to become acting General of the Resistance, during its conflict and subsequent war with the First Order. The son of Lieutenant Shara Bey and Sergeant Kes Dameron of the Alliance to Restore the Republic, Dameron followed in his late mother's footsteps in becoming a pilot, serving the New Republic Defense Fleet as the commander of Rapier Squadron, but grew disillusioned with the Republic's inaction to the First Order's violations of the Galactic Concordance. Dameron defected to the Resistance, where he became one of General Leia Organa's most trusted operatives. Dameron flew under the callsign of Black Leader while piloting his specialized T-70 X-wing starfighter, Black One.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Poe_Dameron",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Yavin 4"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "altTitle": "FN-2187",
    "endYear": 50,
    "endYearUnknown": true,
    "imageUrl": "/images/finn.png",
    "seenIn": [
      "Episode VII: The Force Awakens",
      "Episode VIII: The Last Jedi",
      "Episode IX: The Rise of Skywalker"
    ],
    "startYear": 11,
    "title": "Finn",
    "type": "character",
    "description": "Finn, formerly designated FN-2187 (&quot;Eight-Seven&quot;), was a Force-sensitive human male stormtrooper who served the First Order until his desertion and subsequent defection to the Resistance during the First Order/Resistance War. Though trained since birth to be a loyal and obedient soldier, FN-2187's conscience conflicted with the methods of the First Order. For a time he was unwilling to support the Resistance, hoping to escape the galactic conflict instead of fighting for a cause he believed was doomed to fail. As the galaxy became consumed by war, the renegade trooper was ultimately forced to decide where his true loyalties lay.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Finn",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Unknown"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "altTitle": "Nerf Herder",
    "endYear": 34,
    "imageUrl": "/images/solo-young.png",
    "imageYears": [
      {
        "endYear": 19,
        "imageUrl": "/images/solo-og.png",
        "startYear": -1
      },
      {
        "endYear": 34,
        "imageUrl": "/images/solo-old.png",
        "startYear": 19
      }
    ],
    "seenIn": [
      "Solo: A Star Wars Story",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "Episode VI: Return of the Jedi",
      "Episode VII: The Force Awakens",
      "Episode IX: The Rise of Skywalker"
    ],
    "startYear": -32,
    "title": "Han Solo",
    "type": "character",
    "description": "Han Solo, known only as Han until being given the surname Solo by an Imperial recruitment officer, and formerly known as Cadet 124-329 while serving as an Imperial cadet, was a human male smuggler. He became a leader in the Alliance to Restore the Republic and an instrumental figure in the defeat of the Galactic Empire during the Galactic Civil War. He hailed from Corellia and became a smuggler, even completing the Kessel Run in just twelve parsecs with his prized ship, the Millennium Falcon, and coming under the employ of Jabba the Hutt. He was the son-in-law of fallen Jedi Knight Anakin Skywalker and Senator Padmé Amidala, husband of Princess Leia Organa, brother-in-law of Jedi Master Luke Skywalker, father of Ben Solo, rivals and close friends with fellow smuggler Lando Calrissian, and best friends with the Wookiee Chewbacca, his trusted copilot who swore a life debt to the Corellian smuggler. Solo ran afoul of Jabba after ditching a shipment of spice to avoid trouble with the Empire, owing the Hutt a great deal of money as a result. His fortune seemed to have changed when he agreed to charter Luke Skywalker, Obi-Wan Kenobi, and the droids R2-D2 and C-3PO to Alderaan, but he became caught up in the rebellion against the Empire and, after helping Princess Leia Organa escape from the Death Star, briefly fought in the Battle of Yavin, which allowed Skywalker to destroy the superweapon. Solo fought with the Rebellion for a number of years afterward, taking part in numerous operations and battles against the Empire.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Han_Solo",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Corellia"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "altTitle": "",
    "birthYear": -896,
    "endYear": 4,
    "imageUrl": "/images/yoda-young.png",
    "imageYears": [
      {
        "endYear": 4,
        "imageUrl": "/images/yoda.png",
        "startYear": -2
      }
    ],
    "seenIn": [
      "Episode I: The Phantom Menace",
      "Episode II: Attack of the Clones",
      "The Clone Wars (movie)",
      "The Clone Wars (TV series)",
      "Episode III: Revenge of the Sith",
      "Star Wars Rebels",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "Episode VI: Return of the Jedi",
      "Episode VIII: The Last Jedi"
    ],
    "startYear": -85,
    "title": "Yoda",
    "type": "character",
    "description": "Yoda, a Force-sensitive male being belonging to a mysterious species, was a legendary Jedi Master who witnessed the rise and fall of the Galactic Republic, followed by the rise of the Galactic Empire. Small in stature but revered for his wisdom and power, Yoda trained generations of Jedi, ultimately serving as the Grand Master of the Jedi Order. Having lived through nine centuries of galactic history, he played integral roles in the Clone Wars, the rebirth of the Jedi through Luke Skywalker, and unlocking the path to immortality.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Yoda",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Unknown"
      },
      {
        "name": "Species",
        "value": "Yoda's Species"
      }
    ]
  },
  {
    "altTitle": "Mitth'raw' nuruodo",
    "description": "Mitth'raw'nuruodo, born as Kivu'raw'nuru with the core name Vurawn, recognized in his early military career as Mitth'raw'nuru, and better known by his core name Thrawn, was a Chiss male officer of the Chiss Ascendancy and Grand Admiral in the Imperial Navy during the age of the Galactic Empire. An alien Imperial officer with striking blue skin, red eyes, and an angular face, Thrawn was well known as a brilliant and ruthless strategist. He believed that in order to achieve victory in war, one must know their enemy. As such, he dedicated himself to understanding the philosophy, art, and culture of his opponents, which included the Twi'leks of Ryloth and the warriors of Mandalore. When Governor Arihnda Pryce requested a strong commander capable of defeating the rebels on Lothal, Grand Admiral Thrawn accepted the challenge, intending to dismantle the rebellion one piece at a time.",
    "endYear": 6,
    "endYearUnknown": true,
    "imageUrl": "/images/thrawn.png",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Rentor"
      },
      {
        "name": "Species",
        "value": "Chiss"
      }
    ],
    "seenIn": [
      "Star Wars Rebels"
    ],
    "startYear": -50,
    "title": "Thrawn",
    "type": "character",
    "wookiepedia": "https://starwars.fandom.com/wiki/Mitth'raw'nuruodo"
  },
  {
    "altTitle": "Old Ben",
    "endYear": 0,
    "imageUrl": "/images/obi-young.png",
    "imageYears": [
      {
        "endYear": -10,
        "imageUrl": "/images/obi.png",
        "startYear": -20
      },
      {
        "endYear": 0,
        "imageUrl": "/images/obi-og.png",
        "startYear": -10
      }
    ],
    "seenIn": [
      "Episode I: The Phantom Menace",
      "Episode II: Attack of the Clones",
      "Episode III: Revenge of the Sith",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "The Clone Wars (movie)",
      "The Clone Wars (TV series)",
      "Episode VI: Return of the Jedi"
    ],
    "startYear": -57,
    "title": "Obi-Wan Kenobi",
    "type": "character",
    "description": "Obi-Wan Kenobi, also known as Ben Kenobi, was a human male Jedi Master who served on the Jedi High Council during the final years of the Republic Era. As a Jedi General, Kenobi served in the Grand Army of the Republic that fought against the Separatist Droid Army during the Clone Wars. Kenobi, however, was forced into exile as a result of the Great Jedi Purge. As a mentor, Kenobi was responsible for training two members of the Skywalker family, Anakin Skywalker and Luke Skywalker, both of whom served in turn as his Padawan in the ways of the Force.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Obi-Wan_Kenobi",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Stewjon"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "altTitle": "",
    "endYear": -9,
    "endYearUnknown": true,
    "imageUrl": "/images/hunter.png",
    "seenIn": [
      "The Clone Wars (TV series)",
      "Star Wars: The Bad Batch"
    ],
    "startYear": -29,
    "startYearUnknown": true,
    "title": "Hunter",
    "type": "character",
    "description": "&quot;Hunter&quot; was the nickname of a clone commando sergeant who served as the commanding officer of Clone Force 99 in the Grand Army of the Republic during the Clone Wars, fought between the Galactic Republic and the Confederacy of Independent Systems. He was genetically altered to have heightened senses and commanded his comrades who had their own unique mutations, in what they called the &quot;Bad Batch.&quot; Other members of the squad included Wrecker, Tech, and Crosshair, and later, Echo.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Hunter",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Kamino"
      },
      {
        "name": "Species",
        "value": "Human"
      },
      {
        "name": "Clone",
        "value": "Yes"
      }
    ]
  },
  {
    "altTitle": "Din Djarin",
    "endYear": 20,
    "endYearUnknown": true,
    "imageUrl": "/images/mando.png",
    "seenIn": [
      "The Mandalorian"
    ],
    "startYear": -45,
    "startYearUnknown": true,
    "title": "Mando",
    "type": "character",
    "description": "Din Djarin, also known as &quot;the Mandalorian&quot; or simply &quot;Mando,&quot; was a human male Mandalorian who worked as a famous bounty hunter during the New Republic Era. With his Mandalorian armor, IB-94 blaster pistol, Amban sniper rifle, and distinctive beskar helmet, Djarin was both well-equipped and enigmatic—a stranger whose past was shrouded in mystery to others. Orphaned during the Republic Era, he was raised as a foundling by the Children of the Watch, a group that had broken off from mainstream Mandalorian society. Djarin was not aware of this and believed that all Mandalorians followed the Children of the Watch's beliefs. He was trained to become a Mandalorian warrior and eventually joined the Tribe, which operated in a secret covert on Nevarro and was affiliated with the Children of the Watch. Djarin became battle-hardened, a man of few words, and a formidable hunter in an increasingly dangerous galaxy.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Din_Djarin",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Aq Vetina"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "altTitle": "",
    "endYear": 20,
    "endYearUnknown": true,
    "imageUrl": "/images/boba-young.png",
    "imageYears": [
      {
        "endYear": 5,
        "imageUrl": "/images/boba-og.png",
        "startYear": -17
      },
      {
        "endYear": 20,
        "imageUrl": "/images/boba-old.png",
        "startYear": 5
      }
    ],
    "seenIn": [
      "Episode II: Attack of the Clones",
      "The Clone Wars (TV series)",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "Episode VI: Return of the Jedi",
      "The Mandalorian",
      "The Book of Boba Fett"
    ],
    "startYear": -32,
    "title": "Boba Fett",
    "type": "character",
    "description": "Boba Fett was a human male bounty hunter whose career spanned decades, from the fall of the Galactic Republic to the rise of the Galactic Empire. Originally code-named Alpha, he was an unaltered clone of the famed Mandalorian bounty hunter Jango Fett. Boba emulated his father and genetic donor by wearing a customized suit of Mandalorian armor. His personal starship was the Slave I, a Firespray-31-class patrol and attack craft that once belonged to Jango. Trained in combat and martial skills from a young age, Fett was one of the most feared bounty hunters in the galaxy during the reign of Emperor Palpatine. He became a legend over the course of his career, which included contracts for both the Empire and the extensive criminal underworld.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Boba_Fett",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Kamino"
      },
      {
        "name": "Species",
        "value": "Human"
      },
      {
        "name": "Clone",
        "value": "Yes"
      }
    ]
  },
  {
    "altTitle": "",
    "endYear": -19,
    "imageUrl": "/images/padme.png",
    "seenIn": [
      "Episode I: The Phantom Menace",
      "Episode II: Attack of the Clones",
      "The Clone Wars (movie)",
      "The Clone Wars (TV series)",
      "Episode III: Revenge of the Sith"
    ],
    "startYear": -46,
    "title": "Padmé Amidala Naberrie",
    "type": "character",
    "description": "Padmé Amidala Naberrie was a human female senator who represented the people of Naboo during the final years of the Galactic Republic. Prior to her career in the Galactic Senate, Amidala was the elected ruler of the Royal House of Naboo. A political idealist, she advocated for the preservation of democracy as well as a peaceful resolution to the Clone Wars. However, her secret marriage to the Jedi Knight Anakin Skywalker would have a lasting effect on the future of the galaxy for decades to come.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Padm%C3%A9_Amidala",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Naboo"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "altTitle": "Chewie",
    "endYear": 40,
    "endYearUnknown": true,
    "imageUrl": "/images/chewie.png",
    "seenIn": [
      "Episode III: Revenge of the Sith",
      "Solo: A Star Wars Story",
      "Episode IV: A New Hope",
      "Episode V: The Empire Strikes Back",
      "Episode VI: Return of the Jedi",
      "Episode VII: The Force Awakens",
      "Episode VIII: The Last Jedi",
      "Episode IX: The Rise of Skywalker"
    ],
    "startYear": -85,
    "birthYear": -200,
    "title": "Chewbacca",
    "type": "character",
    "description": "Chewbacca, known affectionately to his friends as Chewie, was a Wookiee male warrior, smuggler, mechanic, pilot, and resistance fighter who fought in the Clone Wars, the Galactic Civil War, and the Cold War and subsequent First Order/Resistance War. He hailed from the planet Kashyyyk and became a Wookiee military leader. During the Clone Wars, he was captured by Trandoshan slavers and held captive on Wasskah, but he worked with a fellow captive, Jedi Commander Ahsoka Tano, to escape. He later commanded Wookiee forces of the Kachirho Wookiee Militia during the Battle of Kashyyyk alongside the Grand Army of the Republic, led by Jedi General Yoda. During the battle, one of the last ones of the war, Yoda's clone troopers received Order 66 from Supreme Chancellor Palpatine and, with the help of Chewbacca and his fellow Wookiee Chieftain and General Tarfful, Yoda escaped Kashyyyk and the destruction of the Jedi Order.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Chewbacca",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Kashyyyk"
      },
      {
        "name": "Species",
        "value": "Wookie"
      }
    ]
  },
  {
    "altTitle": "Grand Moff",
    "endYear": 0,
    "endYearUnknown": true,
    "imageUrl": "/images/tarkin.png",
    "seenIn": [
      "The Clone Wars (TV series)",
      "Episode III: Revenge of the Sith",
      "Star Wars Rebels",
      "Star Wars: The Bad Batch",
      "Rogue One: A Star Wars Story",
      "Episode IV: A New Hope"
    ],
    "startYear": -64,
    "title": "Wilhuff Tarkin",
    "type": "character",
    "description": "Wilhuff Tarkin was a human male politician, bureaucrat, and military officer whose career spanned the Fall of the Republic and the Age of the Empire. Born on the planet Eriadu in 64 BBY, he was a member of the Tarkin family and the great-nephew of Jova Tarkin. During the Republic Era, Tarkin served in the Galactic Republic's Judicial Department for a time before returning to his homeworld as the Governor of Eriadu. When the Clone Wars began, he renewed his military service, becoming a commissioned officer in the Republic Navy.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Wilhuff_Tarkin",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Eriadu"
      },
      {
        "name": "Species",
        "value": "Human"
      }
    ]
  },
  {
    "altTitle": "",
    "endYear": 34,
    "imageUrl": "/images/snoke.png",
    "seenIn": [
      "Episode VII: The Force Awakens",
      "Episode VIII: The Last Jedi"
    ],
    "startYear": 4,
    "title": "Snoke",
    "type": "character",
    "description": "Snoke was a Force-sensitive humanoid strandcast male who ruled the First Order as Supreme Leader during the New Republic Era. Possibly unaware of his true nature, Snoke was an artificial genetic construct created on the planet Exegol by the resurrected Dark Lord of the Sith and former Galactic Emperor Darth Sidious. Cloned from Sidious with various genetic sciences, Snoke was designed to be a proxy that the Sith Lord could manipulate, though he possessed an independent mind and free will.",
    "wookiepedia": "https://starwars.fandom.com/wiki/Snoke",
    "metadata": [
      {
        "name": "Homeworld",
        "value": "Exegol"
      },
      {
        "name": "Species",
        "value": "Humanoid genetic strandcast"
      },
      {
        "name": "Clone",
        "value": "Yes"
      }
    ]
  },
  {
    "endYear": -32,
    "startYear": -32,
    "title": "Episode I: The Phantom Menace",
    "type": "movie"
  },
  {
    "endYear": -22,
    "startYear": -22,
    "title": "Episode II: Attack of the Clones",
    "type": "movie"
  },
  {
    "endYear": -22,
    "startYear": -22,
    "title": "The Clone Wars (movie)",
    "type": "movie"
  },
  {
    "endYear": -19,
    "startYear": -22,
    "title": "The Clone Wars (TV series)",
    "type": "tv"
  },
  {
    "endYear": 0,
    "startYear": -5,
    "title": "Star Wars Rebels",
    "type": "tv"
  },
  {
    "endYear": -19,
    "startYear": -19,
    "title": "Episode III: Revenge of the Sith",
    "type": "movie"
  },
  {
    "endYear": -19,
    "startYear": -19,
    "title": "Star Wars: The Bad Batch",
    "type": "movie"
  },
  {
    "endYear": -10,
    "startYear": -10,
    "title": "Solo: A Star Wars Story",
    "type": "movie"
  },
  {
    "endYear": 0,
    "startYear": 0,
    "title": "Rogue One: A Star Wars Story",
    "type": "movie"
  },
  {
    "endYear": 0,
    "startYear": 0,
    "title": "Episode IV: A New Hope",
    "type": "movie"
  },
  {
    "endYear": 3,
    "startYear": 3,
    "title": "Episode V: The Empire Strikes Back",
    "type": "movie"
  },
  {
    "endYear": 4,
    "startYear": 4,
    "title": "Episode VI: Return of the Jedi",
    "type": "movie"
  },
  {
    "endYear": 9,
    "startYear": 9,
    "title": "The Mandalorian",
    "type": "tv"
  },
  {
    "endYear": 9,
    "startYear": 9,
    "title": "The Book of Boba Fett",
    "type": "movie"
  },
  {
    "endYear": 35,
    "startYear": 34,
    "title": "Star Wars Resistance",
    "type": "movie"
  },
  {
    "endYear": 34,
    "startYear": 34,
    "title": "Episode VII: The Force Awakens",
    "type": "movie"
  },
  {
    "endYear": 34,
    "startYear": 34,
    "title": "Episode VIII: The Last Jedi",
    "type": "movie"
  },
  {
    "endYear": 35,
    "startYear": 35,
    "title": "Episode IX: The Rise of Skywalker",
    "type": "movie"
  }
]