[{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/kanata.png","seenIn":["Episode VII: The Force Awakens","Episode IX: The Rise of Skywalker"],"startYear":-85,"birthYear":-973,"title":"Maz Kanata","type":"character","description":"Maz Kanata, Force-sensitive, was born over a millennium before the brewing war between the First Order and the Resistance. Living in an ancient castle on the planet Takodana, Kanata gained a reputation as a &quot;pirate queen&quot; by allowing traveling smugglers to reside in her home—as long as they honored her prohibitions against politics and war. Kanata spent centuries traveling the galaxy, collecting antiques and trinkets, which she kept inside the storehouses and vaults of her castle. One notable item was the lightsaber crafted by Jedi Knight Anakin Skywalker during the Clone Wars, and later wielded by Skywalker's son, Luke, who was instrumental in toppling the Galactic Empire.","wookiepedia":"https://starwars.fandom.com/wiki/Maz_Kanata","metadata":[{"name":"Homeworld","value":"Takodana"},{"name":"Species","value":"Unknown"}],"index":0,"yearIndex":0,"years":135,"startYearDisplay":"85 BBY","endYearDisplay":"50 ABY"},{"altTitle":"","birthYear":-896,"endYear":4,"imageUrl":"/images/yoda-young.png","imageYears":[{"endYear":4,"imageUrl":"/images/yoda.png","startYear":-2}],"seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith","Star Wars Rebels","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","Episode VIII: The Last Jedi"],"startYear":-85,"title":"Yoda","type":"character","description":"Yoda, a Force-sensitive being belonging to a mysterious species, was a legendary Jedi Master who witnessed the rise and fall of the Galactic Republic, followed by the rise of the Galactic Empire. Small in stature but revered for his wisdom and power, Yoda trained generations of Jedi, ultimately serving as the Grand Master of the Jedi Order. Having lived through nine centuries of galactic history, he played integral roles in the Clone Wars, the rebirth of the Jedi through Luke Skywalker, and unlocking the path to immortality.","wookiepedia":"https://starwars.fandom.com/wiki/Yoda","metadata":[{"name":"Homeworld","value":"Unknown"},{"name":"Species","value":"Yoda's Species"}],"index":1,"yearIndex":0,"years":89,"startYearDisplay":"85 BBY","endYearDisplay":"4 ABY"},{"altTitle":"the Hutt","endYear":4,"imageUrl":"/images/jabba.png","seenIn":["Episode I: The Phantom Menace","The Clone Wars (movie)","The Clone Wars (TV series)","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi"],"startYear":-85,"birthYear":-600,"title":"Jabba Desilijic Tiure","type":"character","description":"Jabba Desilijic Tiure, more commonly referred to as Jabba the Hutt or simply Jabba, and formally styled as His Excellency Jabba Desilijic Tiure of Nal Hutta, Eminence of Tatooine, was a Hutt gangster and crime lord, as well as a member of the Grand Hutt Council, who operated and led a criminal empire from his palace on the Outer Rim world of Tatooine. Jabba was a major figure on Tatooine, where he controlled the bulk of the piracy, slavery, and trafficking in illegal goods that generated most of the planet's wealth. He was also highly influential in the entire Outer Rim as one of its most powerful crime lords.","wookiepedia":"https://starwars.fandom.com/wiki/Jabba_Desilijic_Tiure","metadata":[{"name":"Homeworld","value":"Nal Hutta"},{"name":"Species","value":"Hutt"}],"index":2,"yearIndex":0,"years":89,"startYearDisplay":"85 BBY","endYearDisplay":"4 ABY"},{"altTitle":"Chewie","endYear":50,"endYearUnknown":true,"imageUrl":"/images/chewie.png","seenIn":["Episode III: Revenge of the Sith","Solo: A Star Wars Story","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":-85,"birthYear":-200,"title":"Chewbacca","type":"character","description":"Chewbacca, known affectionately to his friends as Chewie, was a warrior, smuggler, mechanic, pilot, and resistance fighter who fought in the Clone Wars, the Galactic Civil War, and the Cold War and subsequent First Order/Resistance War. He hailed from the planet Kashyyyk and became a Wookiee military leader. During the Clone Wars, he was captured by Trandoshan slavers and held captive on Wasskah, but he worked with a fellow captive, Jedi Commander Ahsoka Tano, to escape. He later commanded Wookiee forces of the Kachirho Wookiee Militia during the Battle of Kashyyyk alongside the Grand Army of the Republic, led by Jedi General Yoda. During the battle, one of the last ones of the war, Yoda's clone troopers received Order 66 from Supreme Chancellor Palpatine and, with the help of Chewbacca and his fellow Wookiee Chieftain and General Tarfful, Yoda escaped Kashyyyk and the destruction of the Jedi Order.","wookiepedia":"https://starwars.fandom.com/wiki/Chewbacca","metadata":[{"name":"Homeworld","value":"Kashyyyk"},{"name":"Species","value":"Wookie"}],"index":3,"yearIndex":0,"years":135,"startYearDisplay":"85 BBY","endYearDisplay":"50 ABY"},{"altTitle":"","endYear":-19,"imageUrl":"/images/plo.png","seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (TV series)","The Clone Wars (movie)","Episode III: Revenge of the Sith"],"birthYear":-100,"startYear":-85,"startYearUnknown":true,"title":"Plo Koon","type":"character","metadata":[{"name":"Homeworld","value":"Dorin"},{"name":"Species","value":"Kel Dor"}],"description":"Plo Koon was a Force-sensitive Jedi Master who served as a member of the Jedi High Council during the last years of the Galactic Republic. He served as a respected Jedi General during the Clone Wars, a pan-galactic conflict between the Republic and its splinter state, the Confederacy of Independent Systems. During the war he frequently undertook dangerous missions with the soldiers under his command, the 104th Battalion.","wookiepedia":"https://starwars.fandom.com/wiki/Plo_Koon","index":4,"yearIndex":0,"years":66,"startYearDisplay":"85 BBY","endYearDisplay":"19 BBY"},{"altTitle":"Darth Sidious","endYear":35,"imageUrl":"/images/palpatine-young.png","imageYears":[{"endYear":0,"imageUrl":"/images/palpatine.png","startYear":-19},{"endYear":25,"imageUrl":"/images/palpatine-og.png","startYear":0},{"endYear":35,"imageUrl":"/images/palpatine-end.png","startYear":25}],"seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","Episode IX: The Rise of Skywalker"],"startYear":-84,"title":"Sheev Palpatine","type":"character","description":"Sheev Palpatine, and also known simply as the Emperor, was a Dark Lord of the Sith known as Darth Sidious, and Emperor of the Galactic Empire, ruling from 19 BBY to 4 ABY. Rising to power in the Republic Senate as the senator of Naboo, the secretive Sith Lord cultivated two identities, Sidious and Palpatine, using both to further his political career. He orchestrated the fall of the Galactic Republic and the Jedi Order through the Clone Wars, and then established his reign over the galaxy which lasted until his death at the Battle of Endor. However, the dark side of the Force gave rise to powers which allowed the Emperor to return from the grave.","wookiepedia":"https://starwars.fandom.com/wiki/Darth_Sidious","metadata":[{"name":"Homeworld","value":"Naboo"},{"name":"Species","value":"Human"}],"index":5,"yearIndex":1,"years":119,"startYearDisplay":"84 BBY","endYearDisplay":"35 ABY"},{"altTitle":"","endYear":-22,"imageUrl":"/images/jango.png","seenIn":["Episode II: Attack of the Clones"],"startYear":-82,"startYearUnknown":true,"title":"Jango Fett","type":"character","description":"Jango Fett was a Mandalorian bounty hunter and the clone template of the Grand Army of the Republic. Known as the best bounty hunter in the galaxy during the final years of the Galactic Republic, Fett was proficient in marksmanship as well as unarmed combat. The Mandalorian armor that he wore featured various weapons and gadgets, including a flamethrower, dual WESTAR-34 blaster pistols, and a jetpack. His personal starship was the Firespray-31-class patrol and attack craft Slave I.","wookiepedia":"https://starwars.fandom.com/wiki/Jango_Fett","metadata":[{"name":"Homeworld","value":"Concord Dawn"},{"name":"Species","value":"Human"}],"index":6,"yearIndex":3,"years":60,"startYearDisplay":"82 BBY","endYearDisplay":"22 BBY"},{"endYear":-32,"imageUrl":"/images/quigon.png","seenIn":["Episode I: The Phantom Menace","The Clone Wars (TV series)"],"startYear":-80,"title":"Qui-Gon Jinn","type":"character","description":"Qui-Gon Jinn, was Force-sensitive, venerable if maverick Jedi Master who lived during the last years of the Republic Era. He was a wise and well-respected member of the Jedi Order, and was offered a seat on the Jedi Council, but chose to reject and follow his own path. Adhering to a philosophy centered around the Living Force, Jinn strove to follow the will of the Force even when his actions conflicted with the wishes of the High Council. After encountering Anakin Skywalker, Jinn brought him to the Jedi Temple on Coruscant, convinced he had found the Chosen One. His dying wish was for Skywalker to become a Jedi and ultimately restore balance to the Force.","wookiepedia":"https://starwars.fandom.com/wiki/Qui-Gon_Jinn","metadata":[{"name":"Homeworld","value":"Coruscant"},{"name":"Species","value":"Human"}],"index":7,"yearIndex":5,"years":48,"startYearDisplay":"80 BBY","endYearDisplay":"32 BBY"},{"endYear":-19,"imageUrl":"/images/mace.png","seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith"],"startYear":-80,"title":"Mace Windu","type":"character","description":"Mace Windu was a revered Jedi Master and member of the Jedi High Council during the last years of the Galactic Republic. During his time in the Jedi Order, he once served as elected leader of the Jedi and, during the Clone Wars, as a Jedi General in the Grand Army of the Republic. He was the greatest champion of the Jedi Order and promoted its ancient traditions amidst the growing influence of the dark side of the Force in the corrupt, declining days of the Republic.","wookiepedia":"https://starwars.fandom.com/wiki/Mace_Windu","metadata":[{"name":"Homeworld","value":"Haruun Kal"},{"name":"Species","value":"Human"}],"index":8,"yearIndex":5,"years":61,"startYearDisplay":"80 BBY","endYearDisplay":"19 BBY"},{"altTitle":"Viceroy","endYear":-19,"imageUrl":"/images/gunray.png","seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith"],"startYear":-69,"startYearUnknown":true,"title":"Nute Gunray","type":"character","description":"Nute Gunray served as the Viceroy of the Trade Federation and a high-ranking member of the Separatist Confederacy of Independent Systems and chairman of the Separatist Council. Gunray led the Trade Federation through its invasion of the planet Naboo, at the behest of the Sith Lord Darth Sidious—who was secretly Sheev Palpatine, the Senator of Naboo, and who had engineered the conflict to be elected Supreme Chancellor. The Federation invasion was repelled and Gunray was arrested, but he avoided punishment after four trials in the Supreme Court.","wookiepedia":"https://starwars.fandom.com/wiki/Nute_Gunray","metadata":[{"name":"Homeworld","value":"Neimoidia"},{"name":"Species","value":"Neimoidian"}],"index":9,"yearIndex":16,"years":50,"startYearDisplay":"69 BBY","endYearDisplay":"19 BBY"},{"altTitle":"Qymaen jai Sheelal","endYear":-19,"imageUrl":"/images/grievous.png","seenIn":["The Clone Wars (TV series)","Episode III: Revenge of the Sith"],"startYear":-65,"startYearUnknown":true,"title":"General Grievous","type":"character","description":"Grievous, born as Qymaen jai Sheelal, was a warlord who served as a commanding officer within the military forces of the Confederacy of Independent Systems during the final years of the Galactic Republic. Despite his position as a general, Grievous held the title of Supreme Martial Commander of the Separatist Droid Army that engaged the Grand Army of the Republic in the pan-galactic Clone Wars. Noted for being ruthless and his extensive cybernetic enhancements, Grievous instilled fear throughout the entire galaxy as he traveled, invading planets and engaging the Jedi Knights of the Republic.","wookiepedia":"https://starwars.fandom.com/wiki/Grievous","metadata":[{"name":"Homeworld","value":"Kalee"},{"name":"Species","value":"Kaleesh"}],"index":10,"yearIndex":20,"years":46,"startYearDisplay":"65 BBY","endYearDisplay":"19 BBY"},{"altTitle":"","endYear":0,"imageUrl":"/images/saw.png","seenIn":["The Clone Wars (TV series)","Star Wars: The Bad Batch","Star Wars Rebels","Rogue One: A Star Wars Story"],"startYear":-65,"startYearUnknown":true,"title":"Saw Gerrera","type":"character","description":"Saw Gerrera was a resistance fighter who, as a leading member of the Onderon rebels, fought against the Confederacy of Independent Systems on Onderon during the Clone Wars. He and his younger sister, Steela Gerrera, were instrumental in the rebel liberation of their homeworld during the Onderonian Civil War. He later became a key member in the fight against the Galactic Empire and the formation of the Alliance to Restore the Republic. His tactics against the Empire led him to be seen as an extremist, one whose notoriety was recognized by the Empire and, many years later, the New Republic.","wookiepedia":"https://starwars.fandom.com/wiki/Saw_Gerrera","metadata":[{"name":"Homeworld","value":"Onderon"},{"name":"Species","value":"Human"}],"index":11,"yearIndex":20,"years":65,"startYearDisplay":"65 BBY","endYearDisplay":"0 BBY"},{"altTitle":"Grand Moff","endYear":0,"imageUrl":"/images/tarkin.png","seenIn":["The Clone Wars (TV series)","Episode III: Revenge of the Sith","Star Wars Rebels","Star Wars: The Bad Batch","Rogue One: A Star Wars Story","Episode IV: A New Hope"],"startYear":-64,"title":"Wilhuff Tarkin","type":"character","description":"Wilhuff Tarkin was a politician, bureaucrat, and military officer whose career spanned the Fall of the Republic and the Age of the Empire. Born on the planet Eriadu in 64 BBY, he was a member of the Tarkin family and the great-nephew of Jova Tarkin. During the Republic Era, Tarkin served in the Galactic Republic's Judicial Department for a time before returning to his homeworld as the Governor of Eriadu. When the Clone Wars began, he renewed his military service, becoming a commissioned officer in the Republic Navy.","wookiepedia":"https://starwars.fandom.com/wiki/Wilhuff_Tarkin","metadata":[{"name":"Homeworld","value":"Eriadu"},{"name":"Species","value":"Human"}],"index":12,"yearIndex":21,"years":64,"startYearDisplay":"64 BBY","endYearDisplay":"0 BBY"},{"endYear":-8,"endYearUnknown":true,"imageUrl":"/images/jarjar.png","seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (TV series)","Episode III: Revenge of the Sith"],"startYear":-60,"startYearUnknown":true,"title":"Jar Jar Binks","type":"character","description":"Jar Jar Binks was a military commander and politician who played a key role during the Invasion of Naboo and the Clone Wars that culminated in the fall of the Galactic Republic and the rise of the Galactic Empire. Once an outcast from Gungan society due to his clumsy behavior, he regained favor with his people by helping secure an alliance between the Gungan boss Rugor Nass and Queen Padmé Amidala of Naboo, an alliance vital in ending the Trade Federation's invasion of their shared homeworld. In the years that followed, Binks became a Junior Representative for his people in the Galactic Senate, serving alongside Amidala once she became the planet's senator.","wookiepedia":"https://starwars.fandom.com/wiki/Jar_Jar_Binks","metadata":[{"name":"Homeworld","value":"Naboo"},{"name":"Species","value":"Gungan"}],"index":13,"yearIndex":25,"years":52,"startYearDisplay":"60 BBY","endYearDisplay":"8 BBY"},{"altTitle":"","endYear":0,"imageUrl":"/images/bailorgana.png","seenIn":["Episode II: Attack of the Clones","The Clone Wars (TV series)","Episode III: Revenge of the Sith","Star Wars Rebels","Rogue One: A Star Wars Story"],"startYear":-60,"startYearUnknown":true,"title":"Bail Organa","type":"character","description":"Bail Prestor Organa was an Alderaanian politician and revolutionary leader, an influential voice for peace in the Galactic Senate during the last days of the Galactic Republic, and a founding member of the Alliance to Restore the Republic. Organa, the senator of Alderaan, was an outspoken member of the Senate's Loyalist Committee that pushed to maintain the ideals of the Republic during the Clone Wars. He became an architect of the early rebellion against the Galactic Empire and believed that a full-scale Galactic Civil War was inevitable if the Empire was to be toppled and replaced by a New Republic.","wookiepedia":"https://starwars.fandom.com/wiki/Bail_Prestor_Organa","metadata":[{"name":"Homeworld","value":"Alderaan"},{"name":"Species","value":"Human"}],"index":14,"yearIndex":25,"years":60,"startYearDisplay":"60 BBY","endYearDisplay":"0 BBY"},{"altTitle":"Old Ben","endYear":0,"imageUrl":"/images/obi-young.png","imageYears":[{"endYear":-10,"imageUrl":"/images/obi.png","startYear":-20},{"endYear":0,"imageUrl":"/images/obi-og.png","startYear":-10}],"seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","Episode III: Revenge of the Sith","Episode IV: A New Hope","Episode V: The Empire Strikes Back","The Clone Wars (movie)","The Clone Wars (TV series)","Episode VI: Return of the Jedi"],"startYear":-57,"title":"Obi-Wan Kenobi","type":"character","description":"Obi-Wan Kenobi, also known as Ben Kenobi, was a Jedi Master who served on the Jedi High Council during the final years of the Republic Era. As a Jedi General, Kenobi served in the Grand Army of the Republic that fought against the Separatist Droid Army during the Clone Wars. Kenobi, however, was forced into exile as a result of the Great Jedi Purge. As a mentor, Kenobi was responsible for training two members of the Skywalker family, Anakin Skywalker and Luke Skywalker, both of whom served in turn as his Padawan in the ways of the Force.","wookiepedia":"https://starwars.fandom.com/wiki/Obi-Wan_Kenobi","metadata":[{"name":"Homeworld","value":"Stewjon"},{"name":"Species","value":"Human"}],"index":15,"yearIndex":28,"years":57,"startYearDisplay":"57 BBY","endYearDisplay":"0 BBY"},{"altTitle":"Darth Tyranus","endYear":-2,"imageUrl":"/images/dooku.png","seenIn":["Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith"],"startYear":-54,"title":"Count Dooku","type":"character","description":"Dooku, Force-sensitive, was a Jedi Master that fell to the dark side of the Force and became the Dark Lord of the Sith Darth Tyranus during the final years of the Galactic Republic. After leaving the Jedi Order, he claimed the title Count of Serenno and, during the Clone Wars, served as Head of State of the Confederacy of Independent Systems. He was the second apprentice of Darth Sidious, the Dark Lord of the Sith whose plan to conquer the galaxy relied on Dooku leading a pan-galactic secessionist movement against the Republic. As such, Dooku immersed himself in the dark side and worked tirelessly to advance his and his master's plans, but ultimately forgot that treachery was the way of the Sith.","wookiepedia":"https://starwars.fandom.com/wiki/Dooku","databank":"https://www.starwars.com/databank/count-dooku","metadata":[{"name":"Homeworld","value":"Serenno"},{"name":"Species","value":"Zabrak"}],"index":16,"yearIndex":31,"years":52,"startYearDisplay":"54 BBY","endYearDisplay":"2 BBY"},{"endYear":-2,"imageUrl":"/images/maul.png","seenIn":["Episode I: The Phantom Menace","The Clone Wars (TV series)","Star Wars Rebels"],"startYear":-54,"title":"Darth Maul","type":"character","description":"Maul, once known as Darth Maul, was Force-sensitive who established himself as a crime lord during the reign of the Galactic Empire. However, he was once the Sith apprentice of Darth Sidious, and therefore, a Dark Lord of the Sith. Having trained in the ways of the Force, Maul was a formidable warrior strong with the dark side and deadly skilled in lightsaber combat. In addition, he was a scheming mastermind who plotted his return to power despite losing his place in the ranks of the Sith.","wookiepedia":"https://starwars.fandom.com/wiki/Maul","metadata":[{"name":"Homeworld","value":"Dathomir"},{"name":"Species","value":"Zabrak"}],"index":17,"yearIndex":31,"years":52,"startYearDisplay":"54 BBY","endYearDisplay":"2 BBY"},{"altTitle":"Uncle","endYear":0,"imageUrl":"/images/owenlars.png","imageYears":[{"startYear":-10,"endYear":-1,"imageUrl":"/images/owenlars-old.png"},{"startYear":0,"endYear":80,"imageUrl":"/images/lars-dead.png"}],"seenIn":["Episode II: Attack of the Clones","Episode III: Revenge of the Sith","Episode IV: A New Hope"],"startYear":-52,"title":"Owen Lars","type":"character","description":"Owen Lars was a moisture farmer from the desert planet Tatooine. He was the son of Aika and Cliegg Lars, and he became the stepbrother of Jedi Knight Anakin Skywalker when Cliegg married Anakin's mother, Shmi Skywalker. In 22 BBY, Shmi was killed by Tusken Raiders, and Cliegg passed away soon after. Lars married his girlfriend, Beru Whitesun, and they toiled to maintain the homestead.","wookiepedia":"https://starwars.fandom.com/wiki/Owen_Lars","metadata":[{"name":"Homeworld","value":"Ator"},{"name":"Species","value":"Human"}],"index":18,"yearIndex":33,"years":52,"startYearDisplay":"52 BBY","endYearDisplay":"0 BBY"},{"altTitle":"Mitth'raw' nuruodo","description":"Thrawn, born as Kivu'raw'nuru with the core name Vurawn, recognized in his early military career as Mitth'raw'nuru, was an officer of the Chiss Ascendancy and Grand Admiral in the Imperial Navy during the age of the Galactic Empire. An alien Imperial officer with striking blue skin, red eyes, and an angular face, Thrawn was well known as a brilliant and ruthless strategist. He believed that in order to achieve victory in war, one must know their enemy. As such, he dedicated himself to understanding the philosophy, art, and culture of his opponents, which included the Twi'leks of Ryloth and the warriors of Mandalore. When Governor Arihnda Pryce requested a strong commander capable of defeating the rebels on Lothal, Grand Admiral Thrawn accepted the challenge, intending to dismantle the rebellion one piece at a time.","endYear":6,"endYearUnknown":true,"imageUrl":"/images/thrawn.png","metadata":[{"name":"Homeworld","value":"Rentor"},{"name":"Species","value":"Chiss"}],"seenIn":["Star Wars Rebels"],"startYear":-50,"title":"Thrawn","type":"character","wookiepedia":"https://starwars.fandom.com/wiki/Mitth'raw'nuruodo","index":19,"yearIndex":35,"years":56,"startYearDisplay":"50 BBY","endYearDisplay":"6 ABY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/frik.png","seenIn":["Episode IX: The Rise of Skywalker"],"startYear":-50,"title":"Babu Frik","type":"character","description":"Babu Frik lived during the time of the New Republic Era and the war between the First Order and the Resistance. He maintained a workshop where he worked as a droidsmith among the Spice Runners of Kijimi. He could reprogram or modify almost any droid, regardless of its security measures. He spoke a fractured, heavily accented form of Basic known as Anzellan.","wookiepedia":"https://starwars.fandom.com/wiki/Babu_Frik","metadata":[{"name":"Homeworld","value":"Kijimi"},{"name":"Species","value":"Anzellan"}],"index":20,"yearIndex":35,"years":100,"startYearDisplay":"50 BBY","endYearDisplay":"50 ABY"},{"altTitle":"","endYear":0,"imageUrl":"/images/berulars.png","imageYears":[{"startYear":-6,"endYear":-1,"imageUrl":"/images/berulars-old.png"},{"startYear":0,"endYear":80,"imageUrl":"/images/lars-dead.png"}],"seenIn":["Episode II: Attack of the Clones","Episode III: Revenge of the Sith","Episode IV: A New Hope"],"startYear":-48,"startYearUnknown":true,"title":"Beru Lars","type":"character","description":"Beru Lars, born Beru Whitesun, was married to Owen Lars, the stepbrother of Jedi Knight Anakin Skywalker, whose son, Luke Skywalker, they raised during the reign of the Galactic Empire. Lars was killed along with her husband by Imperial stormtroopers, who also burned down the Lars moisture farm. With their deaths, Skywalker left his homeworld and joined the Alliance to Restore the Republic.","wookiepedia":"https://starwars.fandom.com/wiki/Beru_Whitesun_Lars","metadata":[{"name":"Homeworld","value":"Tatooine"},{"name":"Species","value":"Human"}],"index":21,"yearIndex":37,"years":48,"startYearDisplay":"48 BBY","endYearDisplay":"0 BBY"},{"altTitle":"","endYear":-19,"imageUrl":"/images/padme.png","seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith"],"startYear":-46,"title":"Padmé Amidala Naberrie","type":"character","description":"Padmé Amidala Naberrie was a senator who represented the people of Naboo during the final years of the Galactic Republic. Prior to her career in the Galactic Senate, Amidala was the elected ruler of the Royal House of Naboo. A political idealist, she advocated for the preservation of democracy as well as a peaceful resolution to the Clone Wars. However, her secret marriage to the Jedi Knight Anakin Skywalker would have a lasting effect on the future of the galaxy for decades to come. She was the mother of Luke and Leia.","wookiepedia":"https://starwars.fandom.com/wiki/Padm%C3%A9_Amidala","metadata":[{"name":"Homeworld","value":"Naboo"},{"name":"Species","value":"Human"}],"index":22,"yearIndex":39,"years":27,"startYearDisplay":"46 BBY","endYearDisplay":"19 BBY"},{"altTitle":"","endYear":15,"endYearUnknown":true,"imageUrl":"/images/mothma.png","seenIn":["The Clone Wars (TV series)","Episode III: Revenge of the Sith","Star Wars Rebels","Rogue One: A Star Wars Story","Episode VI: Return of the Jedi"],"startYear":-46,"title":"Mon Mothma","type":"character","description":"Mon Mothma was a politician and revolutionary leader who served in the Galactic Senate and Imperial Senate as the representative of Chandrila, the leader of the Alliance to Restore the Republic, and the first Chancellor of the New Republic. Mothma came to political prominence during the Separatist Crisis and the Clone Wars when, along with such allies as Senators Bail Prestor Organa and Padmé Amidala, she became an outspoken proponent of peace between the Galactic Republic and the Confederacy of Independent Systems. She also spoke out against the increase in executive power given to Supreme Chancellor Palpatine, who transformed the Republic into the Empire at the war's end.","wookiepedia":"https://starwars.fandom.com/wiki/Mon_Mothma","metadata":[{"name":"Homeworld","value":"Chandrila"},{"name":"Species","value":"Human"}],"index":23,"yearIndex":39,"years":61,"startYearDisplay":"46 BBY","endYearDisplay":"15 ABY"},{"altTitle":"","endYear":-19,"imageUrl":"/images/fisto.png","seenIn":["Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith"],"startYear":-45,"startYearUnknown":true,"title":"Kit Fisto","type":"character","metadata":[{"name":"Homeworld","value":"Glee Anselm"},{"name":"Species","value":"Nautolan"}],"description":"Kit Fisto was a Force-sensitive Jedi Master during the final years of the Galactic Republic. Fisto was known as an expert swordsman, having some of the finest dueling skills in the Jedi Order. A celebrated fighter, Fisto served as a Jedi General of the Grand Army of the Republic during the Clone Wars, a galaxy-wide conflict between the Republic and Confederacy of Independent Systems. He fought in various campaigns and over the course of the war was accepted as a member of the Jedi High Council.","wookiepedia":"https://starwars.fandom.com/wiki/Kit_Fisto","index":24,"yearIndex":40,"years":26,"startYearDisplay":"45 BBY","endYearDisplay":"19 BBY"},{"altTitle":"","endYear":32,"endYearUnknown":true,"imageUrl":"/images/bokatan.png","seenIn":["The Clone Wars (TV series)","The Mandalorian"],"startYear":-45,"startYearUnknown":true,"title":"Bo-Katan Kryze","type":"character","metadata":[{"name":"Homeworld","value":"Mandalore"},{"name":"Species","value":"Human"}],"description":"Bo-Katan Kryze was the leader of the Nite Owls and a lieutenant in Death Watch, a terrorist group, and later during the Imperial Era, became Mand'alor. During the Clone Wars, Kryze's sister, Satine, ruled as the Duchess of Mandalore, and Kryze sought to undo her pacifistic teachings, believing that Mandalore should take pride in its martial history. After Governor Pre Vizsla of Concordia was publicly exposed as the leader of Death Watch, the splinter group was exiled from the Mandalore system. In 19 BBY, Kryze and Vizsla discovered the Sith Lords Maul and Savage Opress. With the Sith, they plotted to reclaim Mandalore, and through Maul's planning, united several criminal syndicates to form the Shadow Collective. Launching a takeover of Mandalore, Satine's rule was overthrown, and Vizsla took control of the planet.","wookiepedia":"https://starwars.fandom.com/wiki/Bo-Katan_Kryze","index":25,"yearIndex":40,"years":77,"startYearDisplay":"45 BBY","endYearDisplay":"32 ABY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/lando-young.png","imageYears":[{"endYear":26,"imageUrl":"/images/lando-og.png","startYear":-5},{"endYear":40,"imageUrl":"/images/lando-old.png","startYear":26}],"seenIn":["Solo: A Star Wars Story","Star Wars Rebels","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","Episode IX: The Rise of Skywalker"],"startYear":-43,"title":"Lando Calrissian","type":"character","description":"Landonis Balthazar &quot;Lando&quot; Calrissian, was a smuggler, gambler, entrepreneur, and card player who became Baron Administrator of Cloud City and, later, a general in the Rebel Alliance. Born on Socorro, he was the owner of the Millennium Falcon before losing it to Han Solo in a game of sabacc on Numidian Prime. After losing the Falcon, Calrissian put an end to his days as a smuggler and became an entrepreneur, setting up a small mining operation on the planet Lothal before eventually becoming the leader of Cloud City in the skies of the planet Bespin.","wookiepedia":"https://starwars.fandom.com/wiki/Landonis_Balthazar_Calrissian","metadata":[{"name":"Homeworld","value":"Socorro"},{"name":"Species","value":"Human"}],"index":26,"yearIndex":42,"years":93,"startYearDisplay":"43 BBY","endYearDisplay":"50 ABY"},{"altTitle":"Darth Vadar","endYear":4,"imageUrl":"/images/vadar-kid.jpg","imageYears":[{"endYear":4,"imageUrl":"/images/vadar.png","startYear":-19},{"endYear":-19,"imageUrl":"/images/anakin.png","startYear":-28},{"endYear":-28,"imageUrl":"/images/vadar-kid.jpg","startYear":-41}],"seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","Episode III: Revenge of the Sith","The Clone Wars (movie)","The Clone Wars (TV series)","Star Wars Rebels","Rogue One: A Star Wars Story","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi"],"startYear":-41,"title":"Anakin Skywalker","type":"character","metadata":[{"name":"Homeworld","value":"Tatooine"},{"name":"Species","value":"Human"}],"description":"Anakin Skywalker was a legendary Force-sensitive person who was a Jedi Knight of the Galactic Republic and the prophesied Chosen One of the Jedi Order, destined to bring balance to the Force. Also known as &quot;Ani&quot; during his childhood, Skywalker earned the moniker &amp; quot;Hero With No Fear&quot; from his accomplishments in the Clone Wars. His alter ego, Darth Vader, the Dark Lord of the Sith, was created when Skywalker turned to the dark side of the Force, during Episode III: Revenge of the Sith, pledging his allegiance to the Sith Lord Darth Sidious at the end of the Republic Era.","wookiepedia":"https://starwars.fandom.com/wiki/Anakin_Skywalker","index":27,"yearIndex":44,"years":45,"startYearDisplay":"41 BBY","endYearDisplay":"4 ABY"},{"altTitle":"The Child","endYear":50,"endYearUnknown":true,"imageUrl":"/images/grogu.png","startYear":-41,"title":"Grogu","type":"character","description":"Grogu, known to many simply as &quot;the Child,&quot; or &quot;Baby Yoda&quot; (although not Yoda's child) was a Force-sensitive Jedi and Mandalorian foundling who belonged to the same species as Jedi Grand Master Yoda and Jedi Master Yaddle.","wookiepedia":"https://starwars.fandom.com/wiki/Grogu","metadata":[{"name":"Homeworld","value":"Unknown"},{"name":"Species","value":"Yoda's Species"}],"seenIn":["The Mandalorian"],"index":28,"yearIndex":44,"years":91,"startYearDisplay":"41 BBY","endYearDisplay":"50 ABY"},{"endYear":20,"seenIn":["The Clone Wars (movie)","The Clone Wars (TV series)","The Mandalorian"],"imageYears":[{"endYear":20,"imageUrl":"/images/ahsoka.png","startYear":2}],"startYear":-36,"title":"Ahsoka Tano","imageUrl":"/images/ahsoka-young.png","type":"character","description":"Ahsoka Tano was a Force-sensitive Togruta, former Jedi Padawan who, after the Clone Wars, helped establish a network of various rebel cells against the Galactic Empire. Tano was discovered on her homeworld of Shili by Jedi Master Plo Koon, who brought her to the Jedi Temple on Coruscant to receive Jedi training. Following the outbreak of the Clone Wars, Jedi Grand Master Yoda assigned the young Tano to be the Padawan learner of Jedi Knight Anakin Skywalker, who nicknamed her &quot;Snips&quot; when she joined him at the Battle of Christophsis. Whereas Tano was eager to prove herself, Skywalker had a reputation for recklessness, and they had a rather difficult start as master and apprentice. Yet they worked together to rescue Rotta, the son of crime lord Jabba Desilijic Tiure, and returned Rotta to his father, thus facilitating a crucial alliance between the Hutt Clan and the Galactic Republic.","wookiepedia":"https://starwars.fandom.com/wiki/Ahsoka_Tano","metadata":[{"name":"Homeworld","value":"Shili"},{"name":"Species","value":"Togruta"}],"index":29,"yearIndex":49,"years":56,"startYearDisplay":"36 BBY","endYearDisplay":"20 ABY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/r2d2.png","seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith","Star Wars Rebels","Rogue One: A Star Wars Story","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","The Mandalorian","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":-35,"startYearUnknown":true,"title":"R2-D2","type":"character","description":"R2-D2, pronounced Artoo-Detoo and often referred to as R2 (Artoo), was an R2-series astromech droid manufactured by Industrial Automaton with masculine programming. A smart, spunky droid who would serve a multitude of masters over his lifetime, R2-D2 was never given a full memory wipe (apart from a partial wipe of select information by Cad Bane during the senate hostage crisis) nor did he ever receive new programming, with these factors resulting in an adventurous and independent attitude. Often finding himself in pivotal moments in galactic history, his bravery and ingenuity saved the galaxy on numerous occasions.","wookiepedia":"https://starwars.fandom.com/wiki/R2-D2","metadata":[{"name":"Homeworld","value":"Naboo"},{"name":"Species","value":"Droid"}],"index":30,"yearIndex":50,"years":85,"startYearDisplay":"35 BBY","endYearDisplay":"50 ABY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/c3po.png","seenIn":["Episode I: The Phantom Menace","Episode II: Attack of the Clones","The Clone Wars (movie)","The Clone Wars (TV series)","Episode III: Revenge of the Sith","Star Wars Rebels","Rogue One: A Star Wars Story","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":-35,"startYearUnknown":true,"title":"C-3PO","type":"character","description":"C-3PO, sometimes spelled See-Threepio, often referred to as Threepio and by some as 3-So, was a 3PO-series protocol droid designed to interact with organics, programmed primarily for etiquette and protocol. He was fluent in over six million forms of communication, and developed a fussy and worry-prone personality throughout his many decades of operation. Along with his counterpart, the astromech droid R2-D2, C-3PO constantly found himself directly involved in pivotal moments of galactic history, and aided in saving the galaxy on many occasions.","wookiepedia":"https://starwars.fandom.com/wiki/C-3PO","metadata":[{"name":"Homeworld","value":"Tatooine"},{"name":"Species","value":"Droid"},{"name":"Creator","value":"Anakin Skywalker"}],"index":31,"yearIndex":50,"years":85,"startYearDisplay":"35 BBY","endYearDisplay":"50 ABY"},{"altTitle":"","endYear":20,"endYearUnknown":true,"imageUrl":"/images/boba-young.png","imageYears":[{"endYear":5,"imageUrl":"/images/boba-og.png","startYear":-17},{"endYear":20,"imageUrl":"/images/boba-old.png","startYear":5}],"seenIn":["Episode II: Attack of the Clones","The Clone Wars (TV series)","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","The Mandalorian","The Book of Boba Fett"],"startYear":-32,"title":"Boba Fett","type":"character","description":"Boba Fett was a bounty hunter whose career spanned decades, from the fall of the Galactic Republic to the rise of the Galactic Empire. Originally code-named Alpha, he was an unaltered clone of the famed Mandalorian bounty hunter Jango Fett. Boba emulated his father and genetic donor by wearing a customized suit of Mandalorian armor. His personal starship was the Slave I, a Firespray-31-class patrol and attack craft that once belonged to Jango. Trained in combat and martial skills from a young age, Fett was one of the most feared bounty hunters in the galaxy during the reign of Emperor Palpatine. He became a legend over the course of his career, which included contracts for both the Empire and the extensive criminal underworld.","wookiepedia":"https://starwars.fandom.com/wiki/Boba_Fett","metadata":[{"name":"Homeworld","value":"Kamino"},{"name":"Species","value":"Human"},{"name":"Clone","value":"Yes"}],"index":32,"yearIndex":53,"years":52,"startYearDisplay":"32 BBY","endYearDisplay":"20 ABY"},{"altTitle":"Nerf Herder","endYear":34,"imageUrl":"/images/solo-young.png","imageYears":[{"endYear":19,"imageUrl":"/images/solo-og.png","startYear":-1},{"endYear":34,"imageUrl":"/images/solo-old.png","startYear":19}],"seenIn":["Solo: A Star Wars Story","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","Episode VII: The Force Awakens","Episode IX: The Rise of Skywalker"],"startYear":-32,"title":"Han Solo","type":"character","description":"Han Solo, known only as Han until being given the surname Solo by an Imperial recruitment officer, and formerly known as Cadet 124-329 while serving as an Imperial cadet, was also a smuggler. He became a leader in the Alliance to Restore the Republic and an instrumental figure in the defeat of the Galactic Empire during the Galactic Civil War. He hailed from Corellia and became a smuggler, even completing the Kessel Run in just twelve parsecs with his prized ship, the Millennium Falcon, and coming under the employ of Jabba the Hutt. He was the son-in-law of fallen Jedi Knight Anakin Skywalker and Senator Padmé Amidala, husband of Princess Leia Organa, brother-in-law of Jedi Master Luke Skywalker, father of Ben Solo, rivals and close friends with fellow smuggler Lando Calrissian, and best friends with the Wookiee Chewbacca, his trusted copilot who swore a life debt to the Corellian smuggler. Solo ran afoul of Jabba after ditching a shipment of spice to avoid trouble with the Empire, owing the Hutt a great deal of money as a result. His fortune seemed to have changed when he agreed to charter Luke Skywalker, Obi-Wan Kenobi, and the droids R2-D2 and C-3PO to Alderaan, but he became caught up in the rebellion against the Empire and, after helping Princess Leia Organa escape from the Death Star, briefly fought in the Battle of Yavin, which allowed Skywalker to destroy the superweapon. Solo fought with the Rebellion for a number of years afterward, taking part in numerous operations and battles against the Empire.","wookiepedia":"https://starwars.fandom.com/wiki/Han_Solo","metadata":[{"name":"Homeworld","value":"Corellia"},{"name":"Species","value":"Human"}],"index":33,"yearIndex":53,"years":66,"startYearDisplay":"32 BBY","endYearDisplay":"34 ABY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/qira.png","seenIn":["Solo: A Star Wars Story"],"startYear":-31,"title":"Qi'ra","type":"character","description":"Qi'ra lived during the reign of the Galactic Empire. She grew up on the streets along with Han as part of the White Worms. Though they were at first rivals, the two scrumrats eventually became lovers. Sometime after Qi'ra was made Head Girl by Lady Proxima, Han and Qi'ra attempted to escape with a vial of coaxium, but were separated at the Coronet Spaceport, with Han getting away, though he promised to return for her.","wookiepedia":"https://starwars.fandom.com/wiki/Qi%27ra","metadata":[{"name":"Homeworld","value":"Corellia"},{"name":"Species","value":"Human"}],"index":34,"yearIndex":54,"years":81,"startYearDisplay":"31 BBY","endYearDisplay":"50 ABY"},{"altTitle":"Din Djarin","endYear":20,"endYearUnknown":true,"imageUrl":"/images/mando.png","seenIn":["The Mandalorian"],"startYear":-30,"startYearUnknown":true,"title":"Mando","type":"character","description":"Din Djarin, also known as &quot;the Mandalorian&quot; or simply &quot;Mando,&quot; was a Mandalorian who worked as a famous bounty hunter during the New Republic Era. With his Mandalorian armor, IB-94 blaster pistol, Amban sniper rifle, and distinctive beskar helmet, Djarin was both well-equipped and enigmatic—a stranger whose past was shrouded in mystery to others. Orphaned during the Republic Era, he was raised as a foundling by the Children of the Watch, a group that had broken off from mainstream Mandalorian society. Djarin was not aware of this and believed that all Mandalorians followed the Children of the Watch's beliefs. He was trained to become a Mandalorian warrior and eventually joined the Tribe, which operated in a secret covert on Nevarro and was affiliated with the Children of the Watch. Djarin became battle-hardened, a man of few words, and a formidable hunter in an increasingly dangerous galaxy.","wookiepedia":"https://starwars.fandom.com/wiki/Din_Djarin","metadata":[{"name":"Homeworld","value":"Aq Vetina"},{"name":"Species","value":"Human"}],"index":35,"yearIndex":55,"years":50,"startYearDisplay":"30 BBY","endYearDisplay":"20 ABY"},{"altTitle":"","endYear":-9,"endYearUnknown":true,"imageUrl":"/images/hunter.png","seenIn":["The Clone Wars (TV series)","Star Wars: The Bad Batch"],"startYear":-29,"startYearUnknown":true,"title":"Hunter","type":"character","description":"&quot;Hunter&quot; was the nickname of a clone commando sergeant who served as the commanding officer of Clone Force 99 in the Grand Army of the Republic during the Clone Wars, fought between the Galactic Republic and the Confederacy of Independent Systems. He was genetically altered to have heightened senses and commanded his comrades who had their own unique mutations, in what they called the &quot;Bad Batch.&quot; Other members of the squad included Wrecker, Tech, and Crosshair, and later, Echo.","wookiepedia":"https://starwars.fandom.com/wiki/Hunter","metadata":[{"name":"Homeworld","value":"Kamino"},{"name":"Species","value":"Human"},{"name":"Clone","value":"Yes"}],"index":36,"yearIndex":56,"years":20,"startYearDisplay":"29 BBY","endYearDisplay":"9 BBY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/shand.png","seenIn":["The Mandalorian","The Book of Boba Fett","Star Wars: The Bad Batch"],"startYear":-25,"startYearUnknown":true,"title":"Fennec Shand","type":"character","description":"Fennec Shand was an assassin, mercenary, and bounty hunter, who worked for many of the top crime syndicates. During the early days of the Galactic Empire, when Clone Force 99 landed on Pantora, Shand took it upon herself to capture the clone girl Omega who had a bounty placed on her. She managed to gain Omega's trust, but betrayed Omega and her friends when clone commando sergeant Hunter came to rescue her. She fought off Wrecker, another member of Clone Force 99, and chased Omega to the top of a tower. Shand dropped Omega onto a hovertruck and followed her. Omega was able to escape her grasp and return to Hunter, but Shand vowed to continue her hunt for the girl.","wookiepedia":"https://starwars.fandom.com/wiki/Fennec_Shand","metadata":[{"name":"Homeworld","value":"Unknown"},{"name":"Species","value":"Human"}],"index":37,"yearIndex":60,"years":75,"startYearDisplay":"25 BBY","endYearDisplay":"50 ABY"},{"endYear":34,"imageUrl":"/images/skywalker-farmboy.jpg","imageYears":[{"endYear":3,"imageUrl":"/images/skywalker-farmboy.jpg","startYear":-19},{"endYear":25,"imageUrl":"/images/skywalker-jedi.jpg","startYear":3},{"endYear":34,"imageUrl":"/images/skywalker.png","startYear":26}],"seenIn":["Episode III: Revenge of the Sith","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","The Mandalorian","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":-19,"title":"Luke Skywalker","type":"character","metadata":[{"name":"Homeworld","value":"Tatooine"},{"name":"Species","value":"Human"}],"description":"Luke Skywalker, was Force-sensitive legendary Jedi Master who fought in the Galactic Civil War during the reign of the Galactic Empire. Along with his companions, Princess Leia Organa and General Han Solo, Skywalker served as a revolutionary on the side of the Alliance to Restore the Republic—an organization committed to the downfall of the Galactic Empire and the restoration of democracy. Following the war, Skywalker became a living legend, and was remembered as one of the greatest Jedi in galactic history. SPOILER ALERT: Luke is the son of Anakin.","wookiepedia":"https://starwars.fandom.com/wiki/Luke_Skywalker","index":38,"yearIndex":66,"years":53,"startYearDisplay":"19 BBY","endYearDisplay":"34 ABY"},{"altTitle":"Skywalker Solo","endYear":35,"imageUrl":"/images/leia.png","imageYears":[{"endYear":34,"imageUrl":"/images/leia-old.png","startYear":26}],"seenIn":["Episode III: Revenge of the Sith","Rogue One: A Star Wars Story","Episode IV: A New Hope","Episode V: The Empire Strikes Back","Episode VI: Return of the Jedi","Star Wars Rebels","Star Wars Resistance","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":-19,"title":"Leia Organa","type":"character","description":"Leia Skywalker Organa Solo was a Force-sensitive political and military leader who served in the Alliance to Restore the Republic during the Imperial Era and the New Republic and Resistance in the subsequent New Republic Era. Adopted into the House of Organa, the Alderaanian royal family, she was Princess Leia Organa of Alderaan, a planet in the Core Worlds known for its dedication to pacifism. The princess was raised as the daughter of Senator Bail Prestor Organa and his wife, Queen Breha Organa, making her the heir to the Alderaanian monarchy. Instilled with the values of her adopted homeworld, Organa devoted her life to the restoration of democracy by opposing authoritarian regimes such as the Galactic Empire and the First Order.","wookiepedia":"https://starwars.fandom.com/wiki/Leia_Skywalker_Organa_Solo","metadata":[{"name":"Homeworld","value":"Alderaan"},{"name":"Species","value":"Human"}],"index":39,"yearIndex":66,"years":54,"startYearDisplay":"19 BBY","endYearDisplay":"35 ABY"},{"altTitle":"","endYear":34,"imageUrl":"/images/phasma.png","seenIn":["Star Wars Resistance","Episode VII: The Force Awakens","Episode VIII: The Last Jedi"],"startYear":0,"startYearUnknown":true,"title":"Phasma","type":"character","description":"Phasma, a stormtrooper captain of the First Order, grew up as a member of the Scyre clan on the nuclear-ravaged world of Parnassos, where she became a formidable warrior, eventually becoming the clan's military leader. Seeking passage offworld, Phasma helped the First Order General Brendol Hux find his ship, in the process betraying her own brother, Keldo, and the rest of her clan. After being rescued, Phasma joined the First Order, abandoning her former life.","wookiepedia":"https://starwars.fandom.com/wiki/Phasma","metadata":[{"name":"Homeworld","value":"Parnassos"},{"name":"Species","value":"Human"}],"index":40,"yearIndex":85,"years":34,"startYearDisplay":"0 BBY","endYearDisplay":"34 ABY"},{"altTitle":"","endYear":35,"imageUrl":"/images/hux.png","seenIn":["Star Wars Resistance","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":0,"title":"Armitage Hux","type":"character","description":"Armitage Hux served as a general in the military forces of the First Order during the New Republic Era. With the support of Supreme Leader Snoke, Hux took command of Starkiller Base and promoted the development of new technology that allowed the First Order fleet to track targets through hyperspace. However, Snoke's death ruined the young general's career trajectory, as did the years that Hux spent jockeying for power against his rival Kylo Ren, who seized control of the First Order as the new Supreme Leader.","wookiepedia":"https://starwars.fandom.com/wiki/Armitage_Hux","metadata":[{"name":"Homeworld","value":"Arkanis"},{"name":"Species","value":"Human"}],"index":41,"yearIndex":85,"years":35,"startYearDisplay":"0 BBY","endYearDisplay":"35 ABY"},{"endYear":50,"endYearUnknown":true,"imageUrl":"/images/dameron.png","seenIn":["Star Wars Resistance","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":2,"title":"Poe Dameron","type":"character","description":"Poe Dameron originally served as a member of the Spice Runners of Kijimi, before becoming a pilot in the New Republic and eventually joining the Resistance, rising to become acting General of the Resistance, during its conflict and subsequent war with the First Order. The son of Lieutenant Shara Bey and Sergeant Kes Dameron of the Alliance to Restore the Republic, Dameron followed in his late mother's footsteps in becoming a pilot, serving the New Republic Defense Fleet as the commander of Rapier Squadron, but grew disillusioned with the Republic's inaction to the First Order's violations of the Galactic Concordance. Dameron defected to the Resistance, where he became one of General Leia Organa's most trusted operatives. Dameron flew under the callsign of Black Leader while piloting his specialized T-70 X-wing starfighter, Black One.","wookiepedia":"https://starwars.fandom.com/wiki/Poe_Dameron","metadata":[{"name":"Homeworld","value":"Yavin 4"},{"name":"Species","value":"Human"}],"index":42,"yearIndex":87,"years":48,"startYearDisplay":"2 ABY","endYearDisplay":"50 ABY"},{"altTitle":"","endYear":34,"imageUrl":"/images/snoke.png","seenIn":["Episode VII: The Force Awakens","Episode VIII: The Last Jedi"],"startYear":4,"title":"Snoke","type":"character","description":"Snoke was a Force-sensitive humanoid strandcast who ruled the First Order as Supreme Leader during the New Republic Era. Possibly unaware of his true nature, Snoke was an artificial genetic construct created on the planet Exegol by the resurrected Dark Lord of the Sith and former Galactic Emperor Darth Sidious. Cloned from Sidious with various genetic sciences, Snoke was designed to be a proxy that the Sith Lord could manipulate, though he possessed an independent mind and free will.","wookiepedia":"https://starwars.fandom.com/wiki/Snoke","metadata":[{"name":"Homeworld","value":"Exegol"},{"name":"Species","value":"Humanoid genetic strandcast"},{"name":"Clone","value":"Yes"}],"index":43,"yearIndex":89,"years":30,"startYearDisplay":"4 ABY","endYearDisplay":"34 ABY"},{"altTitle":"Kylo Ren","endYear":35,"imageUrl":"/images/bensolo.png","seenIn":["Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":5,"title":"Ben Solo","type":"character","description":"Ben Solo, Force-sensitive, fell to the dark side of the Force as Kylo Ren, master of the Knights of Ren and eventual Supreme Leader of the First Order, but returned to the light side shortly before his death. He was born at the end of the Galactic Civil War in 5 ABY, when the Galactic Empire surrendered to the New Republic. His parents, General Han Solo and Princess Leia Organa, were considered great heroes of the Alliance to Restore the Republic, as was his maternal uncle, Jedi Master Luke Skywalker. The heir to the Skywalker bloodline, Ben Solo possessed raw strength in the Force and had the potential for limitless power. During the New Republic Era, Solo was part of a new generation of Jedi apprentices trained by his uncle. He was seduced by the dark side through the machinations of the phantom Dark Lord of the Sith, Darth Sidious, and his creation, Supreme Leader Snoke. Sidious's son had a daughter, Rey, who was born to her mother in 15 ABY. Unknown to any at the time, Solo and Rey were counterparts as a dyad in the Force.","wookiepedia":"https://starwars.fandom.com/wiki/Ben_Solo","metadata":[{"name":"Homeworld","value":"Chandrila"},{"name":"Species","value":"Human"}],"index":44,"yearIndex":90,"years":30,"startYearDisplay":"5 ABY","endYearDisplay":"35 ABY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/tico.png","seenIn":["Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":11,"title":"Rose Tico","type":"character","description":"Rose Tico served in the Resistance as a maintenance worker during their conflict with the First Order, whom Tico had hated since she was a child. Tico's older sister, Paige, was a gunner in the Resistance. Following the Battle of D'Qar, in which her sister was killed, and during the First Order's attack on the Resistance fleet, Tico, former Stormtrooper Finn, and astromech unit BB-8 arrived on the city of Canto Bight to recruit the &quot;Master Codebreaker,&quot; hoping he could disable the First Order's hyperspace tracker. Instead allying with criminal DJ, the four were captured before they could disable the tracker and betrayed by DJ. In the ensuing Battle of Crait, Tico saved Finn's life and, although unconscious, was among the members of the Resistance who escaped aboard the Millennium Falcon.","wookiepedia":"https://starwars.fandom.com/wiki/Rose_Tico","metadata":[{"name":"Homeworld","value":"Hays Minor"},{"name":"Species","value":"Human"}],"index":45,"yearIndex":96,"years":39,"startYearDisplay":"11 ABY","endYearDisplay":"50 ABY"},{"altTitle":"FN-2187","endYear":50,"endYearUnknown":true,"imageUrl":"/images/finn.png","seenIn":["Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":11,"title":"Finn","type":"character","description":"Finn, formerly designated FN-2187 (&quot;Eight-Seven&quot;), was a Force-sensitive person, and stormtrooper who served the First Order until his desertion and subsequent defection to the Resistance during the First Order/Resistance War. Though trained since birth to be a loyal and obedient soldier, FN-2187's conscience conflicted with the methods of the First Order. For a time he was unwilling to support the Resistance, hoping to escape the galactic conflict instead of fighting for a cause he believed was doomed to fail. As the galaxy became consumed by war, the renegade trooper was ultimately forced to decide where his true loyalties lay.","wookiepedia":"https://starwars.fandom.com/wiki/Finn","metadata":[{"name":"Homeworld","value":"Unknown"},{"name":"Species","value":"Human"}],"index":46,"yearIndex":96,"years":39,"startYearDisplay":"11 ABY","endYearDisplay":"50 ABY"},{"endYear":50,"endYearUnknown":true,"imageUrl":"/images/rey.png","seenIn":["Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":15,"title":"Rey Skywalker","type":"character","description":"Rey was a Jedi Master who fought on the side of the Resistance in the war against the First Order. A former scavenger from the planet Jakku, her life was changed by the tumultuous events of the last days of the New Republic Era. Her decision to help the droid BB-8 would set Rey on a course to discovering the Force that awakened within her, leading her to seek out Jedi Master Luke Skywalker for training. Yet despite her commitment to the Jedi Order and the light side of the Force, Rey felt the pull to the dark side due to her anger and the adversarial relationship she had with Ben Solo, a fallen Jedi whom she knew as the dark warrior Kylo Ren. The unique Force-bond between them was a result of their nature as a dyad in the Force. Rey was born a Palpatine, but would take the name of Skywalker, after her masters.","wookiepedia":"https://starwars.fandom.com/wiki/Rey_Skywalker","metadata":[{"name":"Homeworld","value":"Jakku"},{"name":"Species","value":"Human"}],"index":47,"yearIndex":100,"years":35,"startYearDisplay":"15 ABY","endYearDisplay":"50 ABY"},{"altTitle":"","endYear":50,"endYearUnknown":true,"imageUrl":"/images/bb8.png","seenIn":["Star Wars Resistance","Episode VII: The Force Awakens","Episode VIII: The Last Jedi","Episode IX: The Rise of Skywalker"],"startYear":29,"title":"BB-8","type":"character","description":"BB-8, sometimes spelled and pronounced Beebee-Ate and nicknamed BB, was a BB-series astromech droid who operated approximately thirty years after the Battle of Endor. He had a dome head, similar to that of R2 series astromech droids, with the bulk of his body made up of a ball on which the droid's head rolled. BB-8 was mostly white, with some silver and orange on his body, as well as a black photoreceptor. The droid belonged to Resistance pilot Poe Dameron, whom he accompanied during his flights on his T-70 X-wing starfighter.","wookiepedia":"https://starwars.fandom.com/wiki/BB-8","metadata":[{"name":"Homeworld","value":"Hosian Prime"},{"name":"Species","value":"Droid"}],"index":48,"yearIndex":114,"years":21,"startYearDisplay":"29 ABY","endYearDisplay":"50 ABY"}]